#   Дано целое число.
#   Сосчитать и напечатать, сколько в его записи нулей, единиц. двоек и т.д.
chislo=str(input("Введите число: "))
c0=0
c1=0
c2=0
c3=0
c4=0
c5=0
c6=0
c7=0
c8=0
c9=0
for i in chislo:
    if i=='0':
        c0+=1
    elif i=='1':
        c1+=1
    elif i=='2':
        c2+=1
    elif i=='3':
        c3+=1
    elif i=='4':
        c4+=1
    elif i=='5':
        c5+=1
    elif i=='6':
        c6+=1
    elif i=='7':
        c7+=1
    elif i=='8':
        c8+=1
    elif i=='9':
        c9+=1
print(      f"Количество (0): {c0} \n"
      f"Количество (1): {c1} \n"
      f"Количество (2): {c2} \n"
      f"Количество (3): {c3} \n"
      f"Количество (4): {c4} \n"
      f"Количество (5): {c5} \n"
      f"Количество (6): {c6} \n"
      f"Количество (7): {c7} \n"
      f"Количество (8): {c8} \n"
      f"Количество (9): {c9}")
