#    Задача 1-1
#    Ввести два числа x и y.
#    Напечатать сумму и произведение эти чисел (оператор + и *)
x=int(input("Введите число X: "))
y=int(input("Введите число Y: "))
print(f"Сумма чисел x и y = {x+y} \nПроизведение чисел x и y = {x*y}")